import React from 'react';
import { BreadCrumbs } from '../BreadCrumbs/BreadCrumbs';
import {
  PrivacySection,
  PrivacyText,
  PrivacyTitle,
} from './PrivacyPage.styles';

const PrivacyPage = () => {
  return (
    <PrivacySection>
      <BreadCrumbs />
      <PrivacyTitle>Политика конфиденциальностти</PrivacyTitle>
      <PrivacyText>
        Администрация вправе вносить изменения и/или дополнения в настоящие
        Правила в одностороннем порядке без какого-либо специального уведомления
        Пользователей. Пользователь обязуется регулярно проверять условия
        настоящих Правил на предмет их изменения и/или дополнения. Продолжение
        использования Сервиса Пользователем после внесения изменений и/или
        дополнений в настоящие Правила означает принятие их Пользователем и его
        согласие с такими изменениями и/или дополнениями. <br />
        Администрация вправе вносить изменения и/или дополнения в настоящие
        Правила в одностороннем порядке без какого-либо специального уведомления
        Пользователей. Пользователь обязуется регулярно проверять условия
        настоящих Правил на предмет их изменения и/или дополнения. Продолжение
        использования Сервиса Пользователем после внесения изменений и/или
        дополнений в настоящие Правила означает принятие их Пользователем и его
        согласие с такими изменениями и/или дополнениями.Администрация вправе
        вносить изменения и/или дополнения в настоящие Правила в одностороннем
        порядке без какого-либо специального уведомления Пользователей.
        Пользователь обязуется регулярно проверять условия настоящих Правил на
        предмет их изменения и/или дополнения. Продолжение использования Сервиса
        Пользователем после внесения изменений и/или дополнений в настоящие
        Правила означает принятие их Пользователем и его согласие с такими
        изменениями и/или дополнениями.Администрация вправе вносить изменения
        и/или дополнения в настоящие Правила в одностороннем порядке без
        какого-либо специального уведомления Пользователей. Пользователь
        обязуется регулярно проверять условия настоящих Правил на предмет их
        изменения и/или дополнения. Продолжение использования Сервиса
        Пользователем после внесения изменений и/или дополнений в настоящие
        Правила означает принятие их Пользователем и его согласие с такими
        изменениями и/или дополнениями.Администрация вправе вносить изменения
        и/или дополнения в настоящие Правила в одностороннем порядке без
        какого-либо специального уведомления Пользователей. Пользователь
        обязуется регулярно проверять условия настоящих Правил на предмет их
        изменения и/или дополнения. Продолжение использования Сервиса
        Пользователем после внесения изменений и/или дополнений в настоящие
        Правила означает принятие их Пользователем и его согласие с такими
        изменениями и/или дополнениями.Администрация вправе вносить изменения
        и/или дополнения в настоящие Правила в одностороннем порядке без
        какого-либо специального уведомления Пользователей. Пользователь
        обязуется регулярно проверять условия настоящих Правил на предмет их
        изменения и/или дополнения. Продолжение использования Сервиса
        Пользователем после внесения изменений и/или дополнений в настоящие
        Правила означает принятие их Пользователем и его согласие с такими
        изменениями и/или дополнениями.Администрация вправе вносить изменения
        и/или дополнения в настоящие Правила в одностороннем порядке без
        какого-либо специального уведомления Пользователей. Пользователь
        обязуется регулярно проверять условия настоящих Правил на предмет их
        изменения и/или дополнения. Продолжение использования Сервиса
        Пользователем после внесения изменений и/или дополнений в настоящие
        Правила означает принятие их Пользователем и его согласие с такими
        изменениями и/или дополнениями.Администрация вправе вносить изменения
        и/или дополнения в настоящие Правила в одностороннем порядке без
        какого-либо специального уведомления Пользователей. Пользователь
        обязуется регулярно проверять условия настоящих Правил на предмет их
        изменения и/или дополнения. Продолжение использования Сервиса
        Пользователем после внесения изменений и/или дополнений в настоящие
        Правила означает принятие их Пользователем и его согласие с такими
        изменениями и/или дополнениями.Администрация вправе вносить изменения
        и/или дополнения в настоящие Правила в одностороннем порядке без
        какого-либо специального уведомления Пользователей. Пользователь
        обязуется регулярно проверять условия настоящих Правил на предмет их
        изменения и/или дополнения. Продолжение использования Сервиса
        Пользователем после внесения изменений и/или дополнений в настоящие
        Правила означает принятие их Пользователем и его согласие с такими
        изменениями и/или дополнениями.Администрация вправе вносить изменения
        и/или дополнения в настоящие Правила в одностороннем порядке без
        какого-либо специального уведомления Пользователей. Пользователь
        обязуется регулярно проверять условия настоящих Правил на предмет их
        изменения и/или дополнения. Продолжение использования Сервиса
        Пользователем после внесения изменений и/или дополнений в настоящие
        Правила означает принятие их Пользователем и его согласие с такими
        изменениями и/или дополнениями.
      </PrivacyText>
    </PrivacySection>
  );
};

export default PrivacyPage;
