import React from 'react';
import { Container } from '../../Styles/sharedstyles';
import { Wrapper, Item } from './Subcategory.style';

const Subcategory = () => {
  return (
    <>
      <Container>
        <Wrapper>
          <Item>
            <p>Телефоны и аксессуары ........... 16234</p>
            <p>Компьютеры и комплектующие ...... 16234</p>
            <p>Фото / видео .................... 16234</p>
            <p>Тв / видеотехника................ 16234</p>
            <p>Аудиотехника..................... 16234</p>
          </Item>
          <Item>
            <p>Телефоны и аксессуары ........... 16234</p>
            <p>Компьютеры и комплектующие ...... 16234</p>
            <p>Фото / видео .................... 16234</p>
            <p>Тв / видеотехника................ 16234</p>
            <p>Аудиотехника..................... 16234</p>
          </Item>
          <Item>
            <p>Телефоны и аксессуары ........... 16234</p>
            <p>Компьютеры и комплектующие ...... 16234</p>
            <p>Фото / видео .................... 16234</p>
            <p>Тв / видеотехника................ 16234</p>
            <p>Аудиотехника..................... 16234</p>
          </Item>
        </Wrapper>
      </Container>
    </>
  );
};

export default Subcategory;
